Jose_Miguel/tests/jmeter/plans/AutoSpark_Correct_LoadTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="AutoSpark - Pruebas de Rendimiento (CORRECTO)" enabled="true">
      <stringProp name="TestPlan.comments">Pruebas con rutas correctas del backend</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    </TestPlan>
    <hashTree>
      <!-- Configuración HTTP por defecto -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">backend</stringProp>
        <stringProp name="HTTPSampler.port">8080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- Cabeceras HTTP -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- Variables de usuario -->
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Datos Usuarios" enabled="true">
        <stringProp name="filename">/plans/users.csv</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="variableNames">email,password,fullname,phone</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="delimiter">,</stringProp>
      </CSVDataSet>
      <hashTree/>

      <!-- ============================================= -->
      <!-- ESCENARIO 1: NORMAL (5 usuarios)              -->
      <!-- ============================================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="01 - Normal (5 usuarios)" enabled="true">
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <stringProp name="ThreadGroup.loops">10</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- Login -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="HTTPArgument.value">{"email":"juan@test.com","password":"Password123"}</stringProp>
                <stringProp name="HTTPArgument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/autospark/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="Login Exitoso" enabled="true">
            <stringProp name="JSON_PATH">$.email</stringProp>
            <stringProp name="EXPECTED_VALUE">juan@test.com</stringProp>
            <boolProp name="JSONVALIDATION">false</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">false</boolProp>
          </JSONPathAssertion>
          <hashTree/>
        </hashTree>
        
        <!-- Obtener Servicios -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Listar Servicios" enabled="true">
          <stringProp name="HTTPSampler.path">/autospark/service</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        
        <!-- Obtener Reservas -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Listar Reservas" enabled="true">
          <stringProp name="HTTPSampler.path">/autospark/reserva</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        
        <!-- Obtener Usuarios -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Listar Usuarios" enabled="true">
          <stringProp name="HTTPSampler.path">/autospark/users</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- ============================================= -->
      <!-- ESCENARIO 2: CARGA (50 usuarios)              -->
      <!-- ============================================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="02 - Carga (50 usuarios)" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <stringProp name="ThreadGroup.loops">20</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Carga - Listar Servicios" enabled="true">
          <stringProp name="HTTPSampler.path">/autospark/service</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Carga - Listar Reservas" enabled="true">
          <stringProp name="HTTPSampler.path">/autospark/reserva</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- ============================================= -->
      <!-- ESCENARIO 3: ESTRÉS (200 usuarios)            -->
      <!-- ============================================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="03 - Estrés (200 usuarios)" enabled="true">
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <stringProp name="ThreadGroup.loops">30</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Estrés - Login" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="HTTPArgument.value">{"email":"juan@test.com","password":"Password123"}</stringProp>
                <stringProp name="HTTPArgument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/autospark/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- Reportes -->
      <SummaryReport guiclass="SummaryReportGui" testclass="SummaryReport" testname="Reporte Resumen" enabled="true"/>
      <hashTree/>
      <AggregateReport guiclass="AggregateReportGui" testclass="AggregateReport" testname="Reporte Agregado" enabled="true"/>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>